# pandas

In [1]:
import pandas as pd
import numpy as np

### Series

#### Basics

In [2]:
s = pd.Series([0,1,2,3])
s

0    0
1    1
2    2
3    3
dtype: int64

In [3]:
s = pd.Series([0,1,2], index=['a','b','c'])
s

a    0
b    1
c    2
dtype: int64

In [4]:
s.values, type(s.values)

(array([0, 1, 2]), numpy.ndarray)

In [5]:
s.index

Index([u'a', u'b', u'c'], dtype='object')

#### Creation

In [6]:
s = pd.Series(['this', 'is', 'summer'])
s

0      this
1        is
2    summer
dtype: object

In [7]:
s = pd.Series({'one': 'this', 'two': 'is', 'three': 'summer'})
s

one        this
three    summer
two          is
dtype: object

In [8]:
a = np.random.randn(4)
print a
s = pd.Series(a, index = ['winter','spring','summer','autumn'])
s

[ 0.18665717  0.08317109  0.69053347 -1.9387452 ]

winter    0.186657
spring    0.083171
summer    0.690533
autumn   -1.938745
dtype: float64

#### numpy array operations

In [9]:
s1 =  s[s < 0]
s1

autumn   -1.938745
dtype: float64

In [10]:
s2 = s1 + 10
print s2
s1 + s2

autumn    8.061255
dtype: float64

autumn    6.12251
dtype: float64

In [11]:
s = pd.Series(np.random.randn(5))
s.where(s < 0, 1)

0    1.000000
1   -0.815867
2    1.000000
3    1.000000
4   -0.716315
dtype: float64

#### Function application

In [12]:
s = pd.Series(np.random.randn(5))
s.map(np.square)

0    0.411074
1    0.911845
2    0.275791
3    0.936969
4    0.277199
dtype: float64

#### Sorting

In [13]:
s = pd.Series('Happy families are all alike'.split(), index = ['z', 'y', 'x', 'w', 'v'])
s

z       Happy
y    families
x         are
w         all
v       alike
dtype: object

In [14]:
s2 = s.sort_values()
s2

z       Happy
v       alike
w         all
x         are
y    families
dtype: object

In [15]:
s3 = s.sort_index()
s3

v       alike
w         all
x         are
y    families
z       Happy
dtype: object

### DataFrame

#### Creation

In [16]:
data = {'feature_1': ['a', 'a', 'b', 'c', 'c'],
        'feature_2': np.random.randn(5),
        'feature_3': 0,
        'feature_4': map(round, np.random.randn(5))}
df = pd.DataFrame(data)
df

  feature_1  feature_2  feature_3  feature_4
0         a   2.117546          0       -0.0
1         a   1.340778          0        1.0
2         b   0.855541          0        2.0
3         c   0.679999          0        0.0
4         c  -1.257877          0       -1.0

In [17]:
data = {'feature_1': ['a', 'a', 'b', 'c', 'c'],
        'feature_2': np.random.randn(5),
        'feature_3': 0,
        'feature_4': map(round, np.random.randn(5))}
df = pd.DataFrame(data, index=['Bob', 'Marie', 'Emmy', 'George', 'Leopold'])
df

        feature_1  feature_2  feature_3  feature_4
Bob             a   0.199001          0        1.0
Marie           a  -1.164010          0       -1.0
Emmy            b   1.113595          0       -0.0
George          c  -0.226611          0       -1.0
Leopold         c  -0.211272          0        0.0

In [18]:
heights_dict = {'Bob': 178, 'Marie': 167, 'Emmy': 180, 'George': 186, 'Leopold': 170} 
heights_df = pd.Series(heights_dict) 

weights_dict = {'Bob': 60, 'Marie': 58, 'Emmy': 10, 'George': 80, 'Leopold': 55} 
weights_df = pd.Series(weights_dict)

heights_vs_weights = pd.DataFrame({'height': heights_df, 'weight': weights_df})
heights_vs_weights

         height  weight
Bob         178      60
Emmy        180      10
George      186      80
Leopold     170      55
Marie       167      58

In [19]:
heights_dict = {'Bob': 178, 'Marie': 167, 'Emmy': 180} 
heights_df = pd.Series(heights_dict)
weights_dict = {'Jim': 78, 'Marie': 67, 'Emmy': 80} 
weights_df = pd.Series(weights_dict)

heights_vs_weights = pd.DataFrame({'height': heights_df, 'weight': weights_df})
heights_vs_weights

       height  weight
Bob     178.0     NaN
Emmy    180.0    80.0
Jim       NaN    78.0
Marie   167.0    67.0

In [20]:
pd.DataFrame(np.random.rand(3, 2), columns=['foo', 'bar'], index=['a', 'b', 'c'])

        foo       bar
a  0.760503  0.095192
b  0.882697  0.035268
c  0.142389  0.812283

In [21]:
#from_csv = pd.read_csv('csv', header=None)
#from_csv = pd.read_csv('csv', names=['a','b','c'])

#### Summary information

In [22]:
heights_vs_weights.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Bob to Marie
Data columns (total 2 columns):
height    3 non-null float64
weight    3 non-null float64
dtypes: float64(2)
memory usage: 96.0+ bytes

In [23]:
heights_vs_weights.describe()

       height  weight
count     3.0     3.0
mean    175.0    75.0
std       7.0     7.0
min     167.0    67.0
25%     172.5    72.5
50%     178.0    78.0
75%     179.0    79.0
max     180.0    80.0

#### Indexing and selection

In [24]:
df

        feature_1  feature_2  feature_3  feature_4
Bob             a   0.199001          0        1.0
Marie           a  -1.164010          0       -1.0
Emmy            b   1.113595          0       -0.0
George          c  -0.226611          0       -1.0
Leopold         c  -0.211272          0        0.0

In [25]:
# access by label
df['feature_1']

Bob        a
Marie      a
Emmy       b
George     c
Leopold    c
Name: feature_1, dtype: object

In [26]:
df[['feature_1','feature_2']]

        feature_1  feature_2
Bob             a   0.199001
Marie           a  -1.164010
Emmy            b   1.113595
George          c  -0.226611
Leopold         c  -0.211272

In [27]:
# Slicing
df[0:2]

      feature_1  feature_2  feature_3  feature_4
Bob           a   0.199001          0        1.0
Marie         a  -1.164010          0       -1.0

In [28]:
# does NOT work
# df[0]
# KeyError: 0
df[0:1]

    feature_1  feature_2  feature_3  feature_4
Bob         a   0.199001          0        1.0

In [29]:
# iloc: preferred way for index-based access
df.iloc[1]

feature_1          a
feature_2   -1.16401
feature_3          0
feature_4         -1
Name: Marie, dtype: object

In [30]:
df.iloc[1:3,0:2]

      feature_1  feature_2
Marie         a  -1.164010
Emmy          b   1.113595

In [31]:
df.iloc[np.array([True,False,True,False]),1:4]

      feature_2  feature_3  feature_4
Bob    0.199001          0        1.0
Emmy   1.113595          0       -0.0

In [32]:
# loc: preferred way for label-based access

In [33]:
df.loc['Emmy','feature_1':'feature_3']

feature_1         b
feature_2    1.1136
feature_3         0
Name: Emmy, dtype: object

In [34]:
# ix: allows "mixed" access
df.ix['Emmy',0]

'b'

#### pandas -> numpy

In [35]:
df = pd.DataFrame([222,333,444])
print df.values
type(df.values)

[[222]
 [333]
 [444]]

numpy.ndarray

#### numpy -> pandas

In [36]:
df = pd.DataFrame(np.arange(-2,6).reshape(2,4))
df

   0  1  2  3
0 -2 -1  0  1
1  2  3  4  5

### Function application

In [37]:
# numpy ufuncs may be used directly
df.abs()

   0  1  2  3
0  2  1  0  1
1  2  3  4  5

In [38]:
df.sum()

0    0
1    2
2    4
3    6
dtype: int64

In [39]:
df.sum(axis=1)

0    -2
1    14
dtype: int64

In [40]:
# use applymap() to apply custom functions to every element of a DataFrame
import math
def f(x): return math.factorial(abs(x))/x**2.
df.applymap(f)

     0         1         2    3
0  0.5  1.000000       inf  1.0
1  0.5  0.666667  1.500000  4.8

In [41]:
# use apply() to apply a function row-wise or column-wise:
def f(x): return x.sum()/len(x)
df.apply(f)

0    0
1    1
2    2
3    3
dtype: int64

In [42]:
df.apply(f, axis=1)

0   -1
1    3
dtype: int64

### Joins

In [43]:
frame1 = pd.DataFrame({'key1': range(3), 'val1': ['a', 'b', 'c']}, index=['blue','red','green'])
frame1

       key1 val1
blue      0    a
red       1    b
green     2    c

In [44]:
frame2 = pd.DataFrame({'key2': range(1, 5), 'val2': ['f', 'g', 'h', 'i']}, index=['water', 'fire', 'air', 'earth'])
frame2

       key2 val2
water     1    f
fire      2    g
air       3    h
earth     4    i

In [45]:
# merge joins on column names
# inner is also the default
pd.merge(frame1, frame2, left_on='key1', right_on='key2', how='inner')

   key1 val1  key2 val2
0     1    b     1    f
1     2    c     2    g

In [46]:
pd.merge(frame1, frame2, left_on='key1', right_on='key2', how='left')

   key1 val1  key2 val2
0     0    a   NaN  NaN
1     1    b   1.0    f
2     2    c   2.0    g

In [47]:
pd.merge(frame1, frame2, left_on='key1', right_on='key2', how='outer')

   key1 val1  key2 val2
0   0.0    a   NaN  NaN
1   1.0    b   1.0    f
2   2.0    c   2.0    g
3   NaN  NaN   3.0    h
4   NaN  NaN   4.0    i

In [48]:
# join joins on index
frame1.index = ['water', 'air', 'no idea']
frame1

         key1 val1
water       0    a
air         1    b
no idea     2    c

In [49]:
frame2

       key2 val2
water     1    f
fire      2    g
air       3    h
earth     4    i

In [50]:
frame1.join(frame2)
# default is left join

         key1 val1  key2 val2
water       0    a   1.0    f
air         1    b   3.0    h
no idea     2    c   NaN  NaN

In [51]:
frame1.join(frame2, how='inner')

       key1 val1  key2 val2
water     0    a     1    f
air       1    b     3    h

### Concatenation

In [52]:
frame1.columns = ['key', 'val']
frame2.columns = ['key', 'val']
frame1

         key val
water      0   a
air        1   b
no idea    2   c

In [53]:
# by default, duplicate indexes are kept
pd.concat([frame1,frame2])

         key val
water      0   a
air        1   b
no idea    2   c
water      1   f
fire       2   g
air        3   h
earth      4   i

In [54]:
# by default, columns not existing in one dataframe are filled with NaN
frame2.columns = ['other_key', 'val']
pd.concat([frame1,frame2])

         key  other_key val
water    0.0        NaN   a
air      1.0        NaN   b
no idea  2.0        NaN   c
water    NaN        1.0   f
fire     NaN        2.0   g
air      NaN        3.0   h
earth    NaN        4.0   i

In [55]:
# only common columns are kept
pd.concat([frame1,frame2], join='inner')

        val
water     a
air       b
no idea   c
water     f
fire      g
air       h
earth     i

In [56]:
# special keys for each dataframe
pd.concat([frame1,frame2], keys=['frame1','frame2'])

                key  other_key val
frame1 water    0.0        NaN   a
       air      1.0        NaN   b
       no idea  2.0        NaN   c
frame2 water    NaN        1.0   f
       fire     NaN        2.0   g
       air      NaN        3.0   h
       earth    NaN        4.0   i

### Sorting

In [57]:
data = {'feature_25': ['a', 'a', 'b', 'c', 'c'],
        'feature_333': np.random.randn(5),
        'feature_777': 0,
        'feature_4': map(round, np.random.randn(5))}
df = pd.DataFrame(data, index=['Bob', 'Marie', 'Emmy', 'George', 'Leopold'])
df

        feature_25  feature_333  feature_4  feature_777
Bob              a     0.340506       -0.0            0
Marie            a     0.158545       -1.0            0
Emmy             b     1.285961        0.0            0
George           c    -1.293185        1.0            0
Leopold          c     0.859590        0.0            0

In [58]:
# sort by row index
df.sort_index()

        feature_25  feature_333  feature_4  feature_777
Bob              a     0.340506       -0.0            0
Emmy             b     1.285961        0.0            0
George           c    -1.293185        1.0            0
Leopold          c     0.859590        0.0            0
Marie            a     0.158545       -1.0            0

In [59]:
# same as
df.sort_index(axis=0)

        feature_25  feature_333  feature_4  feature_777
Bob              a     0.340506       -0.0            0
Emmy             b     1.285961        0.0            0
George           c    -1.293185        1.0            0
Leopold          c     0.859590        0.0            0
Marie            a     0.158545       -1.0            0

In [60]:
# sort by column index
df.sort_index(axis=1)

        feature_25  feature_333  feature_4  feature_777
Bob              a     0.340506       -0.0            0
Marie            a     0.158545       -1.0            0
Emmy             b     1.285961        0.0            0
George           c    -1.293185        1.0            0
Leopold          c     0.859590        0.0            0

In [61]:
# sort by column value
df.sort_values(by='feature_333')

        feature_25  feature_333  feature_4  feature_777
George           c    -1.293185        1.0            0
Marie            a     0.158545       -1.0            0
Bob              a     0.340506       -0.0            0
Leopold          c     0.859590        0.0            0
Emmy             b     1.285961        0.0            0

### Grouping and aggregation

In [62]:
df = pd.DataFrame({'cat1': ['blue','green','green','green'],
                   'cat2': ['square','circle','circle','square'],
                   'val1': np.random.randn(4),
                   'val2': np.ones(4)},
                 index=['first','second','third','fourth'])
df

         cat1    cat2      val1  val2
first    blue  square  0.055624   1.0
second  green  circle  1.294996   1.0
third   green  circle  1.341033   1.0
fourth  green  square -0.490993   1.0

In [63]:
g = df.groupby('cat1').mean()
g

           val1  val2
cat1
blue   0.055624   1.0
green  0.715012   1.0

In [64]:
g.loc['green']

val1    0.715012
val2    1.000000
Name: green, dtype: float64

In [65]:
g=df.groupby(['cat1','cat2']).mean()
g

                  val1  val2
cat1  cat2
blue  square  0.055624   1.0
green circle  1.318014   1.0
      square -0.490993   1.0

In [66]:
g.loc['green','circle']

val1    1.318014
val2    1.000000
Name: (green, circle), dtype: float64

In [67]:
def range(x): return max(x) - min(x)
df.groupby(['cat1', 'cat2']).agg(['mean','std', range])

                  val1                     val2
                  mean       std     range mean  std range
cat1  cat2
blue  square  0.055624       NaN  0.000000  1.0  NaN   0.0
green circle  1.318014  0.032553  0.046037  1.0  0.0   0.0
      square -0.490993       NaN  0.000000  1.0  NaN   0.0

### Pivoting

In [73]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['a', 'b'], name='category'),
                    columns=pd.Index(['one', 'two', 'three'], name='number'))
data

number    one  two  three
category
a           0    1      2
b           3    4      5

In [74]:
# stack() pivots one level of column labels to form a hierarchical row index
data.stack()

category  number
a         one       0
          two       1
          three     2
b         one       3
          two       4
          three     5
dtype: int64

In [75]:
# unstack() unpivots one level of hierarchical row index into a new level of column labels
# By default, the inner index level is pivoted
# equivalent to unstack(1)
data.stack().unstack()

number    one  two  three
category
a           0    1      2
b           3    4      5

In [79]:
# unpivots the outer level
data.stack().unstack(0)

category  a  b
number
one       0  3
two       1  4
three     2  5

In [94]:
df = pd.DataFrame({'feature1': ['a','a','b','b','c','c','c','c','a','b','a'],
                     'feature2': ['one','two','three','three','one','two','two','one','three','three','three'],
                     'feature3': ['A','B','A','B','A','A','A','A','B','A','A'],
                     'score': [1,2,23,11,15,1,1,1,4,23,5]})
df

   feature1 feature2 feature3  score
0         a      one        A      1
1         a      two        B      2
2         b    three        A     23
3         b    three        B     11
4         c      one        A     15
5         c      two        A      1
6         c      two        A      1
7         c      one        A      1
8         a    three        B      4
9         b    three        A     23
10        a    three        A      5

In [96]:
df.pivot_table(index=['feature1','feature2'], columns=['feature3'])

                  score
feature3              A     B
feature1 feature2
a        one        1.0   NaN
         three      5.0   4.0
         two        NaN   2.0
b        three     23.0  11.0
c        one        8.0   NaN
         two        1.0   NaN

In [97]:
df.pivot_table(index=['feature2'], columns=['feature1','feature3'])

         score
feature1     a          b          c
feature3     A    B     A     B    A
feature2
one        1.0  NaN   NaN   NaN  8.0
three      5.0  4.0  23.0  11.0  NaN
two        NaN  2.0   NaN   NaN  1.0

In [98]:
# default aggregation function is mean()
df.pivot_table(index=['feature2'], columns=['feature1','feature3'], aggfunc='count')

         score
feature1     a         b         c
feature3     A    B    A    B    A
feature2
one        1.0  NaN  NaN  NaN  2.0
three      1.0  1.0  2.0  1.0  NaN
two        NaN  1.0  NaN  NaN  2.0

### Statistics

In [99]:
df = pd.DataFrame(np.arange(8).reshape(2,4))
df

   0  1  2  3
0  0  1  2  3
1  4  5  6  7

In [100]:
df.mean()

0    2.0
1    3.0
2    4.0
3    5.0
dtype: float64

In [101]:
df.mean(axis=0)

0    2.0
1    3.0
2    4.0
3    5.0
dtype: float64

In [102]:
df.mean(axis=1)

0    1.5
1    5.5
dtype: float64

#### Inter-column correlations

In [103]:
df = pd.DataFrame(np.random.randn(16).reshape(4,4), columns=['a','b','c','d'], index=['one','two','three','four'])
df

              a         b         c         d
one   -0.026829  1.685766  0.404972  1.451260
two   -0.761502 -1.245766 -0.918206 -0.036994
three -1.684354  0.928886 -1.348909 -1.116827
four  -1.123997 -0.397181 -0.289132 -1.534878

In [104]:
df.corr()

          a         b         c         d
a  1.000000  0.240751  0.848208  0.894230
b  0.240751  1.000000  0.401915  0.450334
c  0.848208  0.401915  1.000000  0.623772
d  0.894230  0.450334  0.623772  1.000000

#### Histograms

In [105]:
df = df.applymap(round)
df

         a    b    c    d
one   -0.0  2.0  0.0  1.0
two   -1.0 -1.0 -1.0 -0.0
three -2.0  1.0 -1.0 -1.0
four  -1.0 -0.0 -0.0 -2.0

In [106]:
# histogram on column
df.applymap(round)['a'].value_counts()

-1.0    2
-2.0    1
-0.0    1
Name: a, dtype: int64

In [107]:
df.applymap(round).ix['two',:].value_counts()   # histogram on row 'two'

-1.0    3
-0.0    1
Name: two, dtype: int64

### Data transformation

#### Missing values

In [109]:
s = pd.Series(['a', 'a', np.NaN, 'b'])
s.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [110]:
df = pd.DataFrame({'one': pd.Series(['a', 'a', np.NaN, 'b']), 'two':pd.Series(['a', np.NaN, 'c', np.NaN])})
df

   one  two
0    a    a
1    a  NaN
2  NaN    c
3    b  NaN

In [111]:
df.dropna()

  one two
0   a   a

In [112]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [113]:
df.dropna(axis=1,how='all')

   one  two
0    a    a
1    a  NaN
2  NaN    c
3    b  NaN

In [114]:
df.fillna('xxx')

   one  two
0    a    a
1    a  xxx
2  xxx    c
3    b  xxx

In [115]:
df.fillna({'one':'xxx', 'two':'yyy'})

   one  two
0    a    a
1    a  yyy
2  xxx    c
3    b  yyy

#### Duplicates

In [117]:
df = pd.DataFrame({'one':[1,1,1,2,], 'two': [1,1,2,2]})
df

   one  two
0    1    1
1    1    1
2    1    2
3    2    2

In [118]:
df.duplicated()

0    False
1     True
2    False
3    False
dtype: bool

In [119]:
df.drop_duplicates()

   one  two
0    1    1
2    1    2
3    2    2

#### Replacing values

In [121]:
df

   one  two
0    1    1
1    1    1
2    1    2
3    2    2

In [122]:
df.replace(1,999)

   one  two
0  999  999
1  999  999
2  999    2
3    2    2

In [123]:
df.replace({'one':{1:999}, 'two':{1:0}})

   one  two
0  999    0
1  999    0
2  999    2
3    2    2

#### Discretization

In [125]:
ages = pd.Series([66,18,31,50,22,70])
#left boundary is exclusive, right is inclusive
age_categories = pd.cut(ages,[18,30,40,50,60,70,80],include_lowest=True)
age_categories

0    (60, 70]
1    [18, 30]
2    (30, 40]
3    (40, 50]
4    [18, 30]
5    (60, 70]
dtype: category
Categories (6, object): [[18, 30] < (30, 40] < (40, 50] < (50, 60] < (60, 70] < (70, 80]]

In [126]:
# split into quantiles
age_categories = pd.qcut(ages, q=4, precision=1)
age_categories

0        (62, 70]
1      [18, 24.2]
2    (24.2, 40.5]
3      (40.5, 62]
4      [18, 24.2]
5        (62, 70]
dtype: category
Categories (4, object): [[18, 24.2] < (24.2, 40.5] < (40.5, 62] < (62, 70]]

#### Indicator variables

In [128]:
df = pd.DataFrame({'col1': list('abaa'), 'col2': ['air','water','fire','earth']})
df

  col1   col2
0    a    air
1    b  water
2    a   fire
3    a  earth

In [129]:
pd.get_dummies(df)

   col1_a  col1_b  col2_air  col2_earth  col2_fire  col2_water
0     1.0     0.0       1.0         0.0        0.0         0.0
1     0.0     1.0       0.0         0.0        0.0         1.0
2     1.0     0.0       0.0         0.0        1.0         0.0
3     1.0     0.0       0.0         1.0        0.0         0.0